tap "homebrew/cask-fonts"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# C unit testing framework
brew "check"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Generate documentation for several programming languages
brew "doxygen"
# Modern, maintained replacement for ls
brew "eza"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# C++ interface to glib
brew "glibmm"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for USB device access
brew "libusb"
# Library to talk to FTDI chips
brew "libftdi"
# Use Realtek DVB-T dongles as a cheap SDR
brew "librtlsdr"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Multiple Arcade Machine Emulator
brew "mame"
# Menu-driven communications program
brew "minicom"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# Platform built on V8 to build network applications
brew "node"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Cross-platform application and UI framework
brew "qt"
# ANSI C compiler for Intel 8051, Maxim 80DS390, and Zilog Z80
brew "sdcc"
# SOund eXchange: universal sound sample translator
brew "sox"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Voice and text chat software
cask "discord"
# Web browser focusing on privacy
cask "duckduckgo"
cask "font-hack-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Software-defined radio receiver powered by GNU Radio and Qt
cask "gqrx"
# Graphically shows disk usage within a file system
cask "grandperspective"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Archive manager for data compression and backups
cask "rar"
# Control your Sonos system
cask "sonos"
# Music streaming service
cask "spotify"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "saoudrizwan.claude-dev"
vscode "withfig.fig"
